---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.GetHostId
zh: 钢筋、配筋
source: html/aa67c490-8875-2756-c621-49484423d026.htm
---
# Autodesk.Revit.DB.Structure.Rebar.GetHostId Method

**中文**: 钢筋、配筋

The element that contains the rebar.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
The element that the rebar object belongs to, such as a structural
 wall, floor, foundation, beam, brace or column.